#ifndef __I2C_HARDWARE_H__
#define __I2C_HARDWARE_H__

#include "nrf_drv_twi.h"
#include <nrf_delay.h>
#include <hal/nrf_gpio.h>
#include "string.h"

#include "sr3_config.h"


//************************************************************************************************************
// 功能描述:   	初始化IIC，可防止重复初始化
// 函数参数:    无
// 返回值  :	无
//************************************************************************************************************
ret_code_t i2c_init(void);

//************************************************************************************************************
// 功能描述:   	注销IIC
// 函数参数:    无
// 返回值  :	NRF_SUCCESS -> 	成功注销
//************************************************************************************************************
ret_code_t i2c_uninit(void);

//************************************************************************************************************
// 功能描述:   	调用IIC底层函数，发送数据
// 函数参数:    dev_addr 	-> 	设备总线地址
//				pbuf		->	待发送数据的缓存区
//				len			->	待发送数据的长度
//				no_stop		->	发送完数据后，是否无停止位(true: 无停止位, false: 有停止位)
// 返回值  :	NRF_SUCCESS -> 	发送成功
//************************************************************************************************************
ret_code_t i2c_send(uint8_t dev_addr, uint8_t *pbuf, uint16_t len, bool no_stop);

//************************************************************************************************************
// 功能描述:   	调用IIC底层函数，接收数据
// 函数参数:    dev_addr 	-> 	设备总线地址
//				pbuf		->	待接收数据的缓存区
//				len			->	待接收数据的长度
// 返回值  :	NRF_SUCCESS -> 	接收成功
//************************************************************************************************************
ret_code_t i2c_receieve(uint8_t dev_addr, uint8_t *pbuf, uint16_t len);

#endif
